000052  FD   FD-STKXXMST-FILE IS GLOBAL EXTERNAL.
000053	01   FD-STKXXMST-RECORD.
000054	     02  FD-MST-KEY			PIC X(13).
000055	     02  FD-MST-1-KEY			PIC X(40).
000065	     02  FD-MST-2-KEY			PIC X(56).
000066	     02  FD-MST-3-KEY			PIC X(56).
000067	     02  FILLER 			PIC X(347).
000068	     
000850  FD   FD-STKXXPAR-FILE IS GLOBAL EXTERNAL.
000851	01   FD-STKXXPAR-RECORD.
000852	     02  FD-PAR-KEY			PIC X(2).
000853	     02  FILLER 			PIC X(62).
000854
000855  FD   FD-STK00TAB-FILE IS GLOBAL EXTERNAL.
000856	01   FD-STK00TAB-RECORD.
000857	     02  FD-TAB-KEY			PIC X(12).
000858 	     02  FILLER 			PIC X(116). 	     
000859
000860  FD   FD-STKHHPUR-FILE IS GLOBAL EXTERNAL.
000861	01   FD-STKHHPUR-RECORD.
000862	     02  FD-HHPUR-KEY			PIC X(10).
000863	     02  FD-HHPUR-1-KEY			PIC X(8).
000864	     02  FILLER 			PIC X(238).
000865
000866  FD   FD-STKDDPUR-FILE IS GLOBAL EXTERNAL.
000867	01   FD-STKDDPUR-RECORD.
000868	     02  FD-DDPUR-KEY			PIC X(14).
000869	     02  FILLER 			PIC X(242).
000870
000871	FD   FD-STKXXVAT-FILE GLOBAL EXTERNAL.
000872	01   FD-STKXXVAT-RECORD.
000873	     02  FD-VAT-KEY                     PIC X(8).
000874       02  FILLER                         PIC X(120).
000877	     
000887  FD   FD-STKHHVAT-FILE GLOBAL EXTERNAL.
000897	01   FD-STKHHVAT-RECORD.
000907	     02  FD-HHVAT-KEY                   PIC XX.
000917	     02  FILLER 			PIC X(54).
000927
000937  FD   FD-STKDDVAT-FILE GLOBAL EXTERNAL.
000947	01   FD-STKDDVAT-RECORD.
000957	     02  FD-DDVAT-KEY                   PIC X(5).
000967	     02  FILLER 			PIC X(51).
000977
000987  FD   FD-STKEEVAT-FILE GLOBAL EXTERNAL.
000997	01   FD-STKEEVAT-RECORD.
001007	     02  FD-EEVAT-KEY                   PIC X(27).
001017	     02  FILLER 		        PIC X(101).
001027
