000010  01   WL-GLOBAL-VARIABLES GLOBAL.     
000107	     02  WL-MST-ID		     PIC XX.
000117	     02  WL-PAR-ID		     PIC XX.
000123	     02  WL-TAB-ID		     PIC XX.	     
000133	     02  WL-HHPUR-ID		     PIC XX.
000143	     02  WL-DDPUR-ID		     PIC XX.
000153	     02  WL-VAT-ID		     PIC XX.	     
000174	     02  WL-HHVAT-ID		     PIC XX.
000175	     02  WL-DDVAT-ID		     PIC XX.
000176 	     02  WL-EEVAT-ID		     PIC XX.
000186	     02  WL-REPORT-ID	    	     PIC XX.
000190       02  WL-FILENAME                 PIC X(60).
000191       02  WL-SYSTEM-NAME              PIC X(70).
000192	     02  WL-ERROR-MESSAGE            PIC X(70).
000193       02  WL-LIST-STATUS              PIC 99.
000194       02  WL-SEARCH-ID                PIC 9.
000195       02  WL-HIGHLIGHT-STATUS         PIC 9.
000196       02  WL-TRANS-TYPE               PIC 99.
000197       02  WL-CANCEL-TRANS-TYPE        PIC 99.
000198	     02  WL-MAIN-MENU     	     PIC 99.
000199	     02  WL-SUB-MENU   	             PIC 99.
000201       02  WL-PRINT-FLAG               PIC X.
000202       02  WL-TABLE-FLAG               PIC 9.
000203	     02  WL-PROGRAM-ID               PIC X(8).
000204	     02  WL-FORM-ID	             PIC X(8).
000205       02  WL-PREVIOUS-ROW-NO          PIC 9(4).
000206       02  WL-SEQUENCE-NO              PIC 9(4).
000207       02  WL-ROW-NO                   PIC 9(4).
000208       02  WL-TABLE-ROW	             PIC 9(4).
000209       02  WL-TABLE-COLUMN	     PIC 9(4). 
000210       02  WL-PREV-TABLE-ROW	     PIC 9(4).
000211       02  WL-PREV-TABLE-COLUMN	     PIC 9(4). 
000212       02  WL-PREV-ROW-NO              PIC 9(4).
000213       02  WL-MAX-ROWS                 PIC 9(4).
000214       02  WL-INDEX                    PIC 9(4).
000215       02  WL-PAGE-COUNTER             PIC 9(4).
000216       02  WL-LINE-NUMBER	             PIC 9(4).
000217       02  WL-COUNTER 	             PIC 9(4). 
000219       02  WL-LAST-REF-NO  	     PIC 9(8).
000221       02  WL-LAST-SEQUENCE-NO  	     PIC 99.
000222       02  WL-USER-ID                  PIC X(6).
000223	     02  WL-PASSWORD                 PIC X(6). 
000224	     02  WL-DUP-POSITION             PIC 99.     
000225       02  RETURNCODE                  PIC S9(9) COMP-5.
000226	     02  ITEM-CLICK        	     PIC 9     VALUE 0. 
000227       02  POW-PCMLIST OBJECT REFERENCE POW-CLISTITEM.      	
000228       02  WL-KEYWORD.
000229           03  WL-KEYWORD-1	     PIC X(15).
000230           03  WL-KEYWORD-2	     PIC X(15).
000231           03  WL-KEYWORD-3	     PIC X(15).
000232           03  WL-KEYWORD-4	     PIC X(15).
000233           03  WL-KEYWORD-5	     PIC X(15).
000234           03  WL-KEYWORD-6	     PIC X(15).
000235           03  WL-KEYWORD-7	     PIC X(15).
000236           03  WL-KEYWORD-8	     PIC X(15).
000237           03  WL-KEYWORD-9	     PIC X(15).
000238           03  WL-KEYWORD-10	     PIC X(15).       
000239       02  WL-QUOTIENT	             PIC 9(4).
000240       02  WL-REMAINDER	             PIC 9(4).       
000241       02  WL-SYSTEM-DATE.
000242           03  WL-DATE.
000243               04  WL-YEAR             PIC 9(4).
000244    	         88  VALID-YEAR  VALUE  1992 THRU 9999.
000245               04  WL-MONTH            PIC 99.
000246	                 88  VALID-MONTH VALUE 1 THRU 12. 	    
000247               04  WL-DAY	             PIC 99.
000248   	         88  VALID-DAY   VALUE 1 THROUGH 31. 		     
000249           03  FILLER         	     PIC X(13).
000250       02  WL-SYSTEM-TIME              PIC 9(8).
000251       02  WL-REDEF-SYSTEM-TIME REDEFINES WL-SYSTEM-TIME.
000252	         03 WL-HOURS 	             PIC 99.
000253           03 WL-MINUTES               PIC 99.
000254           03 WL-SECONDS               PIC 99.
000255   	 03 FILLER 	             PIC 99.
000280       02  IS-IT-END-OF-FILE 	     PIC X.
000281           88  END-OF-FILE         VALUE "T".
000288       02  IS-IT-DD-END-OF-FILE 	     PIC X.
000289           88  DD-END-OF-FILE      VALUE "T".
000290       02  IS-IT-HH-END-OF-FILE 	     PIC X.
000291           88  HH-END-OF-FILE      VALUE "T".
000294       02  IS-MODIFY-FLAG              PIC X.
000295           88  MODIFY-FLAG         VALUE "T".
000296       02  IS-INVALID-KEY-FOUND        PIC X.
000297	         88  INVALID-FOUND       VALUE "T".
000298       02  IS-IT-FOUND 		     PIC X.
000299	         88 FOUND       	 VALUE "T".
000302       02  STYL        	 	     PIC S9(9) COMP-5.
000303       02  M-TITLE                     PIC X(15) VALUE "MESSAGE".
000304       02  RET                         PIC S9(9) COMP-5. 
000314
000330	01  HLP-STOCK-ITEM GLOBAL EXTERNAL     PIC X(13).
000382  01  HLP-USER-ID GLOBAL EXTERNAL        PIC X(6).
000400  01  HLP-TRANS-TYPE GLOBAL EXTERNAL     PIC 99.
000401  01  HLP-REF-NO GLOBAL EXTERNAL         PIC 9(8).
000402
000408  01  WL-LIST-TYPE-STATUS GLOBAL EXTERNAL PIC X.
000409  01  WL-FUNCTION-KEY     GLOBAL EXTERNAL PIC X.
000410
000411	01  WA-SYS-USER-INFO    GLOBAL EXTERNAL.
000412	    02  WA-SYS-USER-ID                  PIC X(6).
000413	    02  WA-SYS-USER-NAME                PIC X(20).
000414      02  WA-SYS-USER-ACCESS              PIC 9.
000415
000416	01   WE-MONTH-ARRAY GLOBAL.
000417	     02  FILLER 		    PIC 9(12) VALUE 312931303130.
000418	     02  FILLER 		    PIC 9(12) VALUE 313130313031.
000419	01   WE-REDEF-MONTH-ARRAY REDEFINES WE-MONTH-ARRAY GLOBAL.
000420	     02  WE-MONTH		    PIC 99
000430		     OCCURS 12 TIMES.		     
000431
000441	01   WG-MONTH-ARRAY GLOBAL.
000442	     02  FILLER 		    PIC X(9) VALUE "JANUARY".
000443	     02  FILLER 		    PIC X(9) VALUE "FEBRUARY".       
000444	     02  FILLER 		    PIC X(9) VALUE "MARCH".     
000445 	     02  FILLER 		    PIC X(9) VALUE "APRIL".       
000446	     02  FILLER 		    PIC X(9) VALUE "MAY".       
000447	     02  FILLER 		    PIC X(9) VALUE "JUNE".       
000448	     02  FILLER 		    PIC X(9) VALUE "JULY".
000449	     02  FILLER 		    PIC X(9) VALUE "AUGUST".       
000450	     02  FILLER 		    PIC X(9) VALUE "SEPTEMBER".     
000451 	     02  FILLER 		    PIC X(9) VALUE "OCTOBER".       
000452	     02  FILLER 		    PIC X(9) VALUE "NOVEMBER".       
000453	     02  FILLER 		    PIC X(9) VALUE "DECEMBER".       
000454	01   WG-REDEF-MONTH-ARRAY REDEFINES WG-MONTH-ARRAY GLOBAL.
000455	     02  WG-MONTH		    PIC X(9)
000456		     OCCURS 12 TIMES.		     
000457
000458	01   WF-ARRAY GLOBAL.
000459	     02  FILLER 		    PIC X(18)
000460		 VALUE "JANFEBMARAPRMAYJUN".
000461	     02  FILLER 		    PIC X(18)
000462		 VALUE "JULAUGSEPOCTNOVDEC".
000463	01   WF-MONTH-ARRAY REDEFINES WF-ARRAY GLOBAL.
000464	     02  WF-MONTH		    PIC X(3)
000465		     OCCURS 12 TIMES.
000466
001143  01  WD-STKXXMST-RECORD GLOBAL.
001144 	     02  WD-MST-KEY.
001146           03  WD-MST-STOCK-ITEM  	PIC X(13).
001147       02  WD-MST-1-KEY.
001149       	 03  WD-MST-DESCRIPTION		PIC X(40).
001182       02  WD-MST-2-KEY.
001183       	 03  WD-MST-CATEGORY   		PIC X(3).
001184       	 03  WD-MST-2-DESCRIPTION	PIC X(40).
001185           03  WD-MST-2-STOCK-ITEM        PIC X(13).
001186       02  WD-MST-3-KEY.
001187       	 03  WD-MST-3-CATEGORY 		PIC X(3).
001189           03  WD-MST-3-STOCK-ITEM        PIC X(13).
001190       	 03  WD-MST-3-DESCRIPTION	PIC X(40).
001191       02  WD-MST-RETAIL-PRICE		PIC 9(8)V99.
001192       02  WD-MST-WHOLESALE-PRICE         PIC 9(8)V99.
001193       02  WD-MST-USER-ID                 PIC X(6).
001194       02  FILLER 			PIC X(175).
001195
001196	01   WD-STKXXPAR-RECORD IS GLOBAL.
001197	     02  WD-PAR-KEY.
001198		 03  WD-PAR-TRANS-TYPE		PIC 99.
001199	     02  WD-PAR-LAST-REF-NO		PIC 9(8).
001200	     02  FILLER 			PIC X(54).
001201
001202	01   WD-STKHHPUR-RECORD IS GLOBAL.
001207	     02  WD-HHPUR-KEY.
001217		 03  WD-HHPUR-TRANS-TYPE	PIC 99.
001227		 03  WD-HHPUR-REF-NO            PIC 9(8).
001237	     02  WD-HHPUR-1-KEY.
001247	         03  WD-HHPUR-DATE		PIC 9(8).
001257	         03  WD-HHPUR-REDEF-DATE REDEFINES WD-HHPUR-DATE.
001267	             04  WD-HHPUR-YEAR		PIC 9(4).                                                  
001277	             04  WD-HHPUR-MONTH		PIC 99.
001287	             04  WD-HHPUR-DAY		PIC 99.
001297	     02  WD-HHPUR-TOTAL-QUANTITY	PIC 9(8)V99.
001317	     02  WD-HHPUR-REMARKS		PIC X(60).
001327       02  WD-HHPUR-UPDATE-FLAG           PIC 9.
001337	     02  WD-HHPUR-USER-ID		PIC X(6).
001347	     02  WD-HHPUR-SUPPLIER-NO           PIC X(4).
001348	     02  FILLER 			PIC X(92).
001357
001367	01   WD-STKDDPUR-RECORD IS GLOBAL.
001377	     02  WD-DDPUR-KEY.
001387		 03  WD-DDPUR-TRANS-TYPE	PIC 99.
001397		 03  WD-DDPUR-REF-NO            PIC 9(8).
001407		 03  WD-DDPUR-SEQUENCE-NO	PIC 9(4).
001417	     02  WD-DDPUR-STOCK-ITEM            PIC X(13).
001457	     02  WD-DDPUR-QUANTITY		PIC 9(6)V99.
001487	     02  FILLER 			PIC X(156).
001497
002815	01   WD1-STK00TAB-RECORD GLOBAL.
002825	     02  WD1-TAB-KEY.
002835	     	 03  WD1-RECORD-ID		PIC 99   VALUE 01.		
002845	     	 03  WD1-FILLER			PIC X(8) VALUE ZERO.
002855	     	 03  WD1-COMPANY-CODE		PIC 99.
002865	     02  WD1-COMPANY-NAME		PIC X(40).
002875	     02  WD1-STORE-NO			PIC XX.
002885	     02  WD1-PRINTER-1			PIC X(7).
002895	     02  WD1-PRINTER-2			PIC X(7).
002905	     02  WD1-PRINTER-3			PIC X(7).
002915	     02  WD1-START-DATE 	    PIC 9(8).
002925	     02  WD1-REDEF-START-DATE REDEFINES WD1-START-DATE.
002935		 03  WD1-START-YEAR	    PIC 9(4).
002945		 03  WD1-START-MONTH	    PIC 99.
002955		 03  WD1-START-DAY	    PIC 99.
002965	     02  WD1-LAST-DATE		    PIC 9(8).
002975	     02  WD1-REDEF-LAST-DATE REDEFINES WD1-LAST-DATE.
002985		 03  WD1-LAST-YEAR	    PIC 9(4).
002995		 03  WD1-LAST-MONTH	    PIC 99.
003005		 03  WD1-LAST-DAY	    PIC 99.
003015	     02  WD1-FISCAL-YEAR	    PIC 9(4).
003016	     02  WD1-PRINT-HEADING 	    PIC X.
003025	     02  WD1-ABBREV-NAME            PIC X(20).
003026	     02  FILLER   	 	    PIC X(74).
003035
004105	01   WD-STKXXVAT-RECORD GLOBAL.
004115	     02  WD-VAT-KEY.
004125		 03  WD-VAT-USER-ID 		PIC X(8).
004135	     02  WD-VAT-USER-NAME		PIC X(20).
004145	     02  WD-VAT-PASSWORD		PIC X(8).
004155	     02  WD-VAT-ACCESS-LEVEL		PIC 9.
004165	     02  WD-VAT-MAIN-MENU		PIC 99 OCCURS 30 TIMES.
004166       02  WD-VAT-COLOUR-CODE             PIC 99.
004175	     02  FILLER 			PIC X(31).
004185	     
004195	01   WD-STKHHVAT-RECORD GLOBAL.
004205	     02  WD-HHVAT-KEY.		 
004215		 03  WD-HHVAT-MAIN-MENU		PIC 99.
004225	     02  WD-HHVAT-DESCRIPTION		PIC X(30).
004235	     02  FILLER 			PIC X(24).
004245
004255	01   WD-STKDDVAT-RECORD GLOBAL.
004265	     02  WD-DDVAT-KEY.		 
004275		 03  WD-DDVAT-MAIN-MENU		PIC 99.
004285 	         03  WD-DDVAT-SUB-MENU		PIC 9(3).	 
004295	     02  WD-DDVAT-MENU-NAME		PIC X(30).
004305	     02  WD-DDVAT-PROGRAM-NAME		PIC X(8).
004315	     02  WD-DDVAT-ACCESS-FLAG		PIC 9.
004325	     02  WD-DDVAT-CREATE-FLAG		PIC 9.
004335	     02  WD-DDVAT-MODIFY-FLAG		PIC 9.
004345	     02  WD-DDVAT-DELETE-FLAG		PIC 9.
004355	     02  WD-DDVAT-INTERROGATE-FLAG	PIC 9.
004365	     02  WD-DDVAT-PRINT-FLAG		PIC 9.
004375	     02  FILLER 			PIC X(7).
004385
004395	01   WD-STKEEVAT-RECORD GLOBAL.
004405	     02  WD-EEVAT-KEY.
004415	         03  WD-EEVAT-DATE	        PIC 9(8).
004425	         03  WD-REDEF-EEVAT-DATE REDEFINES WD-EEVAT-DATE.
004435	             04  WD-EEVAT-YEAR	        PIC 9(4).
004445	             04  WD-EEVAT-MONTH       	PIC 99.
004455	             04  WD-EEVAT-DAY		PIC 99.
004465           03  WD-EEVAT-HOURS	        PIC 99.
004475           03  WD-EEVAT-MINUTES		PIC 99. 	         	     	     	     	             
004485           03  WD-EEVAT-SECONDS		PIC 99. 	         	     	     	     	             
004495		 03  WD-EEVAT-USER-ID		PIC X(8).
004505		 03  WD-EEVAT-MAIN-MENU		PIC 99.
004515 	         03  WD-EEVAT-SUB-MENU		PIC 9(3).	 
004525	     02  WD-EEVAT-MENU-NAME        	PIC X(30).
004535	     02  FILLER 		        PIC X(24).
004545
